garyPenhook/PIC-Assembler/device_includes/pic16f17575.inc
// Register: APMPREH
#define APMPREH APMPREH
APMPREH                                  equ 01F4Eh
// bitfield definitions
APMPREH_PRE_POSN                         equ 0000h
APMPREH_PRE_POSITION                     equ 0000h
APMPREH_PRE_SIZE                         equ 0008h
APMPREH_PRE_LENGTH                       equ 0008h
APMPREH_PRE_MASK                         equ 00FFh
APMPREH_PRE8_POSN                        equ 0000h
APMPREH_PRE8_POSITION                    equ 0000h
APMPREH_PRE8_SIZE                        equ 0001h
APMPREH_PRE8_LENGTH                      equ 0001h
APMPREH_PRE8_MASK                        equ 0001h
APMPREH_PRE9_POSN                        equ 0001h
APMPREH_PRE9_POSITION                    equ 0001h
APMPREH_PRE9_SIZE                        equ 0001h
APMPREH_PRE9_LENGTH                      equ 0001h
APMPREH_PRE9_MASK                        equ 0002h
APMPREH_PRE10_POSN                       equ 0002h
APMPREH_PRE10_POSITION                   equ 0002h
APMPREH_PRE10_SIZE                       equ 0001h
APMPREH_PRE10_LENGTH                     equ 0001h
APMPREH_PRE10_MASK                       equ 0004h
APMPREH_PRE11_POSN                       equ 0003h
APMPREH_PRE11_POSITION                   equ 0003h
APMPREH_PRE11_SIZE                       equ 0001h
APMPREH_PRE11_LENGTH                     equ 0001h
APMPREH_PRE11_MASK                       equ 0008h
APMPREH_PRE12_POSN                       equ 0004h
APMPREH_PRE12_POSITION                   equ 0004h
APMPREH_PRE12_SIZE                       equ 0001h
APMPREH_PRE12_LENGTH                     equ 0001h
APMPREH_PRE12_MASK                       equ 0010h
APMPREH_PRE13_POSN                       equ 0005h
APMPREH_PRE13_POSITION                   equ 0005h
APMPREH_PRE13_SIZE                       equ 0001h
APMPREH_PRE13_LENGTH                     equ 0001h
APMPREH_PRE13_MASK                       equ 0020h
APMPREH_PRE14_POSN                       equ 0006h
APMPREH_PRE14_POSITION                   equ 0006h
APMPREH_PRE14_SIZE                       equ 0001h
APMPREH_PRE14_LENGTH                     equ 0001h
APMPREH_PRE14_MASK                       equ 0040h
APMPREH_PRE15_POSN                       equ 0007h
APMPREH_PRE15_POSITION                   equ 0007h
APMPREH_PRE15_SIZE                       equ 0001h
APMPREH_PRE15_LENGTH                     equ 0001h
APMPREH_PRE15_MASK                       equ 0080h
APMPREH_APMPRE_POSN                      equ 0000h
APMPREH_APMPRE_POSITION                  equ 0000h
APMPREH_APMPRE_SIZE                      equ 0008h
APMPREH_APMPRE_LENGTH                    equ 0008h
APMPREH_APMPRE_MASK                      equ 00FFh
APMPREH_APMPRE8_POSN                     equ 0000h
APMPREH_APMPRE8_POSITION                 equ 0000h
APMPREH_APMPRE8_SIZE                     equ 0001h
APMPREH_APMPRE8_LENGTH                   equ 0001h
APMPREH_APMPRE8_MASK                     equ 0001h
APMPREH_APMPRE9_POSN                     equ 0001h
APMPREH_APMPRE9_POSITION                 equ 0001h
APMPREH_APMPRE9_SIZE                     equ 0001h
APMPREH_APMPRE9_LENGTH                   equ 0001h
APMPREH_APMPRE9_MASK                     equ 0002h
APMPREH_APMPRE10_POSN                    equ 0002h
APMPREH_APMPRE10_POSITION                equ 0002h
APMPREH_APMPRE10_SIZE                    equ 0001h
APMPREH_APMPRE10_LENGTH                  equ 0001h
APMPREH_APMPRE10_MASK                    equ 0004h
APMPREH_APMPRE11_POSN                    equ 0003h
APMPREH_APMPRE11_POSITION                equ 0003h
APMPREH_APMPRE11_SIZE                    equ 0001h
APMPREH_APMPRE11_LENGTH                  equ 0001h
APMPREH_APMPRE11_MASK                    equ 0008h
APMPREH_APMPRE12_POSN                    equ 0004h
APMPREH_APMPRE12_POSITION                equ 0004h
APMPREH_APMPRE12_SIZE                    equ 0001h
APMPREH_APMPRE12_LENGTH                  equ 0001h
APMPREH_APMPRE12_MASK                    equ 0010h
APMPREH_APMPRE13_POSN                    equ 0005h
APMPREH_APMPRE13_POSITION                equ 0005h
APMPREH_APMPRE13_SIZE                    equ 0001h
APMPREH_APMPRE13_LENGTH                  equ 0001h
APMPREH_APMPRE13_MASK                    equ 0020h
APMPREH_APMPRE14_POSN                    equ 0006h
APMPREH_APMPRE14_POSITION                equ 0006h
APMPREH_APMPRE14_SIZE                    equ 0001h
APMPREH_APMPRE14_LENGTH                  equ 0001h
APMPREH_APMPRE14_MASK                    equ 0040h
APMPREH_APMPRE15_POSN                    equ 0007h
APMPREH_APMPRE15_POSITION                equ 0007h
APMPREH_APMPRE15_SIZE                    equ 0001h
APMPREH_APMPRE15_LENGTH                  equ 0001h
APMPREH_APMPRE15_MASK                    equ 0080h

// Register: APMPERL
#define APMPERL APMPERL
APMPERL                                  equ 01F4Fh
// bitfield definitions
APMPERL_PER_POSN                         equ 0000h
APMPERL_PER_POSITION                     equ 0000h
APMPERL_PER_SIZE                         equ 0008h
APMPERL_PER_LENGTH                       equ 0008h
APMPERL_PER_MASK                         equ 00FFh
APMPERL_PER0_POSN                        equ 0000h
APMPERL_PER0_POSITION                    equ 0000h
APMPERL_PER0_SIZE                        equ 0001h
APMPERL_PER0_LENGTH                      equ 0001h
APMPERL_PER0_MASK                        equ 0001h
APMPERL_PER1_POSN                        equ 0001h
APMPERL_PER1_POSITION                    equ 0001h
APMPERL_PER1_SIZE                        equ 0001h
APMPERL_PER1_LENGTH                      equ 0001h
APMPERL_PER1_MASK                        equ 0002h
APMPERL_PER2_POSN                        equ 0002h
APMPERL_PER2_POSITION                    equ 0002h
APMPERL_PER2_SIZE                        equ 0001h
APMPERL_PER2_LENGTH                      equ 0001h
APMPERL_PER2_MASK                        equ 0004h
APMPERL_PER3_POSN                        equ 0003h
APMPERL_PER3_POSITION                    equ 0003h
APMPERL_PER3_SIZE                        equ 0001h
APMPERL_PER3_LENGTH                      equ 0001h
APMPERL_PER3_MASK                        equ 0008h
APMPERL_PER4_POSN                        equ 0004h
APMPERL_PER4_POSITION                    equ 0004h
APMPERL_PER4_SIZE                        equ 0001h
APMPERL_PER4_LENGTH                      equ 0001h
APMPERL_PER4_MASK                        equ 0010h
APMPERL_PER5_POSN                        equ 0005h
APMPERL_PER5_POSITION                    equ 0005h
APMPERL_PER5_SIZE                        equ 0001h
APMPERL_PER5_LENGTH                      equ 0001h
APMPERL_PER5_MASK                        equ 0020h
APMPERL_PER6_POSN                        equ 0006h
APMPERL_PER6_POSITION                    equ 0006h
APMPERL_PER6_SIZE                        equ 0001h
APMPERL_PER6_LENGTH                      equ 0001h
APMPERL_PER6_MASK                        equ 0040h
APMPERL_PER7_POSN                        equ 0007h
APMPERL_PER7_POSITION                    equ 0007h
APMPERL_PER7_SIZE                        equ 0001h
APMPERL_PER7_LENGTH                      equ 0001h
APMPERL_PER7_MASK                        equ 0080h
APMPERL_APMPER_POSN                      equ 0000h
APMPERL_APMPER_POSITION                  equ 0000h
APMPERL_APMPER_SIZE                      equ 0008h
APMPERL_APMPER_LENGTH                    equ 0008h
APMPERL_APMPER_MASK                      equ 00FFh
APMPERL_APMPER0_POSN                     equ 0000h
APMPERL_APMPER0_POSITION                 equ 0000h
APMPERL_APMPER0_SIZE                     equ 0001h
APMPERL_APMPER0_LENGTH                   equ 0001h
APMPERL_APMPER0_MASK                     equ 0001h
APMPERL_APMPER1_POSN                     equ 0001h
APMPERL_APMPER1_POSITION                 equ 0001h
APMPERL_APMPER1_SIZE                     equ 0001h
APMPERL_APMPER1_LENGTH                   equ 0001h
APMPERL_APMPER1_MASK                     equ 0002h
APMPERL_APMPER2_POSN                     equ 0002h
APMPERL_APMPER2_POSITION                 equ 0002h
APMPERL_APMPER2_SIZE                     equ 0001h
APMPERL_APMPER2_LENGTH                   equ 0001h
APMPERL_APMPER2_MASK                     equ 0004h
APMPERL_APMPER3_POSN                     equ 0003h
APMPERL_APMPER3_POSITION                 equ 0003h
APMPERL_APMPER3_SIZE                     equ 0001h
APMPERL_APMPER3_LENGTH                   equ 0001h
APMPERL_APMPER3_MASK                     equ 0008h
APMPERL_APMPER4_POSN                     equ 0004h
APMPERL_APMPER4_POSITION                 equ 0004h
APMPERL_APMPER4_SIZE                     equ 0001h
APMPERL_APMPER4_LENGTH                   equ 0001h
APMPERL_APMPER4_MASK                     equ 0010h
APMPERL_APMPER5_POSN                     equ 0005h
APMPERL_APMPER5_POSITION                 equ 0005h
APMPERL_APMPER5_SIZE                     equ 0001h
APMPERL_APMPER5_LENGTH                   equ 0001h
APMPERL_APMPER5_MASK                     equ 0020h
APMPERL_APMPER6_POSN                     equ 0006h
APMPERL_APMPER6_POSITION                 equ 0006h
APMPERL_APMPER6_SIZE                     equ 0001h
APMPERL_APMPER6_LENGTH                   equ 0001h
APMPERL_APMPER6_MASK                     equ 0040h
APMPERL_APMPER7_POSN                     equ 0007h
APMPERL_APMPER7_POSITION                 equ 0007h
APMPERL_APMPER7_SIZE                     equ 0001h
APMPERL_APMPER7_LENGTH                   equ 0001h
APMPERL_APMPER7_MASK                     equ 0080h

// Register: APMPERH
#define APMPERH APMPERH
APMPERH                                  equ 01F50h
// bitfield definitions
APMPERH_PER_POSN                         equ 0000h
APMPERH_PER_POSITION                     equ 0000h
APMPERH_PER_SIZE                         equ 0008h
APMPERH_PER_LENGTH                       equ 0008h
APMPERH_PER_MASK                         equ 00FFh
APMPERH_PER8_POSN                        equ 0000h
APMPERH_PER8_POSITION                    equ 0000h
APMPERH_PER8_SIZE                        equ 0001h
APMPERH_PER8_LENGTH                      equ 0001h
APMPERH_PER8_MASK                        equ 0001h
APMPERH_PER9_POSN                        equ 0001h
APMPERH_PER9_POSITION                    equ 0001h
APMPERH_PER9_SIZE                        equ 0001h
APMPERH_PER9_LENGTH                      equ 0001h
APMPERH_PER9_MASK                        equ 0002h
APMPERH_PER10_POSN                       equ 0002h
APMPERH_PER10_POSITION                   equ 0002h
APMPERH_PER10_SIZE                       equ 0001h
APMPERH_PER10_LENGTH                     equ 0001h
APMPERH_PER10_MASK                       equ 0004h
APMPERH_PER11_POSN                       equ 0003h
APMPERH_PER11_POSITION                   equ 0003h
APMPERH_PER11_SIZE                       equ 0001h
APMPERH_PER11_LENGTH                     equ 0001h
APMPERH_PER11_MASK                       equ 0008h
APMPERH_PER12_POSN                       equ 0004h
APMPERH_PER12_POSITION                   equ 0004h
APMPERH_PER12_SIZE                       equ 0001h
APMPERH_PER12_LENGTH                     equ 0001h
APMPERH_PER12_MASK                       equ 0010h
APMPERH_PER13_POSN                       equ 0005h
APMPERH_PER13_POSITION                   equ 0005h
APMPERH_PER13_SIZE                       equ 0001h
APMPERH_PER13_LENGTH                     equ 0001h
APMPERH_PER13_MASK                       equ 0020h
APMPERH_PER14_POSN                       equ 0006h
APMPERH_PER14_POSITION                   equ 0006h
APMPERH_PER14_SIZE                       equ 0001h
APMPERH_PER14_LENGTH                     equ 0001h
APMPERH_PER14_MASK                       equ 0040h
APMPERH_PER15_POSN                       equ 0007h
APMPERH_PER15_POSITION                   equ 0007h
APMPERH_PER15_SIZE                       equ 0001h
APMPERH_PER15_LENGTH                     equ 0001h
APMPERH_PER15_MASK                       equ 0080h
APMPERH_APMPER_POSN                      equ 0000h
APMPERH_APMPER_POSITION                  equ 0000h
APMPERH_APMPER_SIZE                      equ 0008h
APMPERH_APMPER_LENGTH                    equ 0008h
APMPERH_APMPER_MASK                      equ 00FFh
APMPERH_APMPER8_POSN                     equ 0000h
APMPERH_APMPER8_POSITION                 equ 0000h
APMPERH_APMPER8_SIZE                     equ 0001h
APMPERH_APMPER8_LENGTH                   equ 0001h
APMPERH_APMPER8_MASK                     equ 0001h
APMPERH_APMPER9_POSN                     equ 0001h
APMPERH_APMPER9_POSITION                 equ 0001h
APMPERH_APMPER9_SIZE                     equ 0001h
APMPERH_APMPER9_LENGTH                   equ 0001h
APMPERH_APMPER9_MASK                     equ 0002h
APMPERH_APMPER10_POSN                    equ 0002h
APMPERH_APMPER10_POSITION                equ 0002h
APMPERH_APMPER10_SIZE                    equ 0001h
APMPERH_APMPER10_LENGTH                  equ 0001h
APMPERH_APMPER10_MASK                    equ 0004h
APMPERH_APMPER11_POSN                    equ 0003h
APMPERH_APMPER11_POSITION                equ 0003h
APMPERH_APMPER11_SIZE                    equ 0001h
APMPERH_APMPER11_LENGTH                  equ 0001h
APMPERH_APMPER11_MASK                    equ 0008h
APMPERH_APMPER12_POSN                    equ 0004h
APMPERH_APMPER12_POSITION                equ 0004h
APMPERH_APMPER12_SIZE                    equ 0001h
APMPERH_APMPER12_LENGTH                  equ 0001h
APMPERH_APMPER12_MASK                    equ 0010h
APMPERH_APMPER13_POSN                    equ 0005h
APMPERH_APMPER13_POSITION                equ 0005h
APMPERH_APMPER13_SIZE                    equ 0001h
APMPERH_APMPER13_LENGTH                  equ 0001h
APMPERH_APMPER13_MASK                    equ 0020h
APMPERH_APMPER14_POSN                    equ 0006h
APMPERH_APMPER14_POSITION                equ 0006h
APMPERH_APMPER14_SIZE                    equ 0001h
APMPERH_APMPER14_LENGTH                  equ 0001h
APMPERH_APMPER14_MASK                    equ 0040h
APMPERH_APMPER15_POSN                    equ 0007h
APMPERH_APMPER15_POSITION                equ 0007h
APMPERH_APMPER15_SIZE                    equ 0001h
APMPERH_APMPER15_LENGTH                  equ 0001h
APMPERH_APMPER15_MASK                    equ 0080h

// Register: APMSTART1L
#define APMSTART1L APMSTART1L
APMSTART1L                               equ 01F51h
// bitfield definitions
APMSTART1L_START1_POSN                   equ 0000h
APMSTART1L_START1_POSITION               equ 0000h
APMSTART1L_START1_SIZE                   equ 0008h
APMSTART1L_START1_LENGTH                 equ 0008h
APMSTART1L_START1_MASK                   equ 00FFh

// Register: APMSTART1H
#define APMSTART1H APMSTART1H
APMSTART1H                               equ 01F52h
// bitfield definitions
APMSTART1H_START1_POSN                   equ 0000h
APMSTART1H_START1_POSITION               equ 0000h
APMSTART1H_START1_SIZE                   equ 0008h
APMSTART1H_START1_LENGTH                 equ 0008h
APMSTART1H_START1_MASK                   equ 00FFh

// Register: APMPERS1L
#define APMPERS1L APMPERS1L
APMPERS1L                                equ 01F53h
// bitfield definitions
APMPERS1L_APMPERS1_POSN                  equ 0000h
APMPERS1L_APMPERS1_POSITION              equ 0000h
APMPERS1L_APMPERS1_SIZE                  equ 0008h
APMPERS1L_APMPERS1_LENGTH                equ 0008h
APMPERS1L_APMPERS1_MASK                  equ 00FFh
APMPERS1L_SOSC_POSN                      equ 0000h
APMPERS1L_SOSC_POSITION                  equ 0000h
APMPERS1L_SOSC_SIZE                      equ 0001h
APMPERS1L_SOSC_LENGTH                    equ 0001h
APMPERS1L_SOSC_MASK                      equ 0001h
APMPERS1L_POSC_POSN                      equ 0001h
APMPERS1L_POSC_POSITION                  equ 0001h
APMPERS1L_POSC_SIZE                      equ 0001h
APMPERS1L_POSC_LENGTH                    equ 0001h
APMPERS1L_POSC_MASK                      equ 0002h
APMPERS1L_BG_POSN                        equ 0002h
APMPERS1L_BG_POSITION                    equ 0002h
APMPERS1L_BG_SIZE                        equ 0001h
APMPERS1L_BG_LENGTH                      equ 0001h
APMPERS1L_BG_MASK                        equ 0004h
APMPERS1L_FVR1_POSN                      equ 0003h
APMPERS1L_FVR1_POSITION                  equ 0003h
APMPERS1L_FVR1_SIZE                      equ 0001h
APMPERS1L_FVR1_LENGTH                    equ 0001h
APMPERS1L_FVR1_MASK                      equ 0008h
APMPERS1L_FVR2_POSN                      equ 0004h
APMPERS1L_FVR2_POSITION                  equ 0004h
APMPERS1L_FVR2_SIZE                      equ 0001h
APMPERS1L_FVR2_LENGTH                    equ 0001h
APMPERS1L_FVR2_MASK                      equ 0010h
APMPERS1L_ADCD_POSN                      equ 0005h
APMPERS1L_ADCD_POSITION                  equ 0005h
APMPERS1L_ADCD_SIZE                      equ 0001h
APMPERS1L_ADCD_LENGTH                    equ 0001h
APMPERS1L_ADCD_MASK                      equ 0020h
APMPERS1L_ADCA_POSN                      equ 0006h
APMPERS1L_ADCA_POSITION                  equ 0006h
APMPERS1L_ADCA_SIZE                      equ 0001h
APMPERS1L_ADCA_LENGTH                    equ 0001h
APMPERS1L_ADCA_MASK                      equ 0040h
APMPERS1L_TEMP_POSN                      equ 0007h
APMPERS1L_TEMP_POSITION                  equ 0007h
APMPERS1L_TEMP_SIZE                      equ 0001h
APMPERS1L_TEMP_LENGTH                    equ 0001h
APMPERS1L_TEMP_MASK                      equ 0080h

// Register: APMPERS1H
#define APMPERS1H APMPERS1H
APMPERS1H                                equ 01F54h
// bitfield definitions
APMPERS1H_APMPERS1_POSN                  equ 0000h
APMPERS1H_APMPERS1_POSITION              equ 0000h
APMPERS1H_APMPERS1_SIZE                  equ 0008h
APMPERS1H_APMPERS1_LENGTH                equ 0008h
APMPERS1H_APMPERS1_MASK                  equ 00FFh
APMPERS1H_OPA1_POSN                      equ 0000h
APMPERS1H_OPA1_POSITION                  equ 0000h
APMPERS1H_OPA1_SIZE                      equ 0001h
APMPERS1H_OPA1_LENGTH                    equ 0001h
APMPERS1H_OPA1_MASK                      equ 0001h
APMPERS1H_OPA2_POSN                      equ 0001h
APMPERS1H_OPA2_POSITION                  equ 0001h
APMPERS1H_OPA2_SIZE                      equ 0001h
APMPERS1H_OPA2_LENGTH                    equ 0001h
APMPERS1H_OPA2_MASK                      equ 0002h
APMPERS1H_DAC1_POSN                      equ 0002h
APMPERS1H_DAC1_POSITION                  equ 0002h
APMPERS1H_DAC1_SIZE                      equ 0001h
APMPERS1H_DAC1_LENGTH                    equ 0001h
APMPERS1H_DAC1_MASK                      equ 0004h
APMPERS1H_DAC2_POSN                      equ 0003h
APMPERS1H_DAC2_POSITION                  equ 0003h
APMPERS1H_DAC2_SIZE                      equ 0001h
APMPERS1H_DAC2_LENGTH                    equ 0001h
APMPERS1H_DAC2_MASK                      equ 0008h
APMPERS1H_CMP1_POSN                      equ 0005h
APMPERS1H_CMP1_POSITION                  equ 0005h
APMPERS1H_CMP1_SIZE                      equ 0001h
APMPERS1H_CMP1_LENGTH                    equ 0001h
APMPERS1H_CMP1_MASK                      equ 0020h
APMPERS1H_CMPLP1_POSN                    equ 0006h
APMPERS1H_CMPLP1_POSITION                equ 0006h
APMPERS1H_CMPLP1_SIZE                    equ 0001h
APMPERS1H_CMPLP1_LENGTH                  equ 0001h
APMPERS1H_CMPLP1_MASK                    equ 0040h
APMPERS1H_ZCD_POSN                       equ 0007h
APMPERS1H_ZCD_POSITION                   equ 0007h
APMPERS1H_ZCD_SIZE                       equ 0001h
APMPERS1H_ZCD_LENGTH                     equ 0001h
APMPERS1H_ZCD_MASK                       equ 0080h

// Register: APMPERS1U
#define APMPERS1U APMPERS1U
APMPERS1U                                equ 01F55h
// bitfield definitions
APMPERS1U_APMPERS1_POSN                  equ 0000h
APMPERS1U_APMPERS1_POSITION              equ 0000h
APMPERS1U_APMPERS1_SIZE                  equ 0008h
APMPERS1U_APMPERS1_LENGTH                equ 0008h
APMPERS1U_APMPERS1_MASK                  equ 00FFh
APMPERS1U_OPA3_POSN                      equ 0000h
APMPERS1U_OPA3_POSITION                  equ 0000h
APMPERS1U_OPA3_SIZE                      equ 0001h
APMPERS1U_OPA3_LENGTH                    equ 0001h
APMPERS1U_OPA3_MASK                      equ 0001h
APMPERS1U_OPA4_POSN                      equ 0001h
APMPERS1U_OPA4_POSITION                  equ 0001h
APMPERS1U_OPA4_SIZE                      equ 0001h
APMPERS1U_OPA4_LENGTH                    equ 0001h
APMPERS1U_OPA4_MASK                      equ 0002h
APMPERS1U_VREFLPDAC_POSN                 equ 0006h
APMPERS1U_VREFLPDAC_POSITION             equ 0006h
APMPERS1U_VREFLPDAC_SIZE                 equ 0001h
APMPERS1U_VREFLPDAC_LENGTH               equ 0001h
APMPERS1U_VREFLPDAC_MASK                 equ 0040h
APMPERS1U_VREFLP_POSN                    equ 0007h
APMPERS1U_VREFLP_POSITION                equ 0007h
APMPERS1U_VREFLP_SIZE                    equ 0001h
APMPERS1U_VREFLP_LENGTH                  equ 0001h
APMPERS1U_VREFLP_MASK                    equ 0080h

// Register: APMSTART2L
#define APMSTART2L APMSTART2L
APMSTART2L                               equ 01F56h
// bitfield definitions
APMSTART2L_START2_POSN                   equ 0000h
APMSTART2L_START2_POSITION               equ 0000h
APMSTART2L_START2_SIZE                   equ 0008h
APMSTART2L_START2_LENGTH                 equ 0008h
APMSTART2L_START2_MASK                   equ 00FFh

