garyPenhook/PIC-Assembler/device_includes/pic16f17575.inc
// Register: APMCLK
#define APMCLK APMCLK
APMCLK                                   equ 01F68h
// bitfield definitions
APMCLK_CLK0_POSN                         equ 0000h
APMCLK_CLK0_POSITION                     equ 0000h
APMCLK_CLK0_SIZE                         equ 0001h
APMCLK_CLK0_LENGTH                       equ 0001h
APMCLK_CLK0_MASK                         equ 0001h
APMCLK_CLK1_POSN                         equ 0001h
APMCLK_CLK1_POSITION                     equ 0001h
APMCLK_CLK1_SIZE                         equ 0001h
APMCLK_CLK1_LENGTH                       equ 0001h
APMCLK_CLK1_MASK                         equ 0002h
APMCLK_CLK2_POSN                         equ 0002h
APMCLK_CLK2_POSITION                     equ 0002h
APMCLK_CLK2_SIZE                         equ 0001h
APMCLK_CLK2_LENGTH                       equ 0001h
APMCLK_CLK2_MASK                         equ 0004h
APMCLK_CLK3_POSN                         equ 0003h
APMCLK_CLK3_POSITION                     equ 0003h
APMCLK_CLK3_SIZE                         equ 0001h
APMCLK_CLK3_LENGTH                       equ 0001h
APMCLK_CLK3_MASK                         equ 0008h
APMCLK_CLK4_POSN                         equ 0004h
APMCLK_CLK4_POSITION                     equ 0004h
APMCLK_CLK4_SIZE                         equ 0001h
APMCLK_CLK4_LENGTH                       equ 0001h
APMCLK_CLK4_MASK                         equ 0010h
APMCLK_CLK5_POSN                         equ 0005h
APMCLK_CLK5_POSITION                     equ 0005h
APMCLK_CLK5_SIZE                         equ 0001h
APMCLK_CLK5_LENGTH                       equ 0001h
APMCLK_CLK5_MASK                         equ 0020h
APMCLK_CLK6_POSN                         equ 0006h
APMCLK_CLK6_POSITION                     equ 0006h
APMCLK_CLK6_SIZE                         equ 0001h
APMCLK_CLK6_LENGTH                       equ 0001h
APMCLK_CLK6_MASK                         equ 0040h
APMCLK_CLK7_POSN                         equ 0007h
APMCLK_CLK7_POSITION                     equ 0007h
APMCLK_CLK7_SIZE                         equ 0001h
APMCLK_CLK7_LENGTH                       equ 0001h
APMCLK_CLK7_MASK                         equ 0080h
APMCLK_CLK_POSN                          equ 0000h
APMCLK_CLK_POSITION                      equ 0000h
APMCLK_CLK_SIZE                          equ 0008h
APMCLK_CLK_LENGTH                        equ 0008h
APMCLK_CLK_MASK                          equ 00FFh
APMCLK_APMCLK_POSN                       equ 0000h
APMCLK_APMCLK_POSITION                   equ 0000h
APMCLK_APMCLK_SIZE                       equ 0008h
APMCLK_APMCLK_LENGTH                     equ 0008h
APMCLK_APMCLK_MASK                       equ 00FFh
APMCLK_APMCLK0_POSN                      equ 0000h
APMCLK_APMCLK0_POSITION                  equ 0000h
APMCLK_APMCLK0_SIZE                      equ 0001h
APMCLK_APMCLK0_LENGTH                    equ 0001h
APMCLK_APMCLK0_MASK                      equ 0001h
APMCLK_APMCLK1_POSN                      equ 0001h
APMCLK_APMCLK1_POSITION                  equ 0001h
APMCLK_APMCLK1_SIZE                      equ 0001h
APMCLK_APMCLK1_LENGTH                    equ 0001h
APMCLK_APMCLK1_MASK                      equ 0002h
APMCLK_APMCLK2_POSN                      equ 0002h
APMCLK_APMCLK2_POSITION                  equ 0002h
APMCLK_APMCLK2_SIZE                      equ 0001h
APMCLK_APMCLK2_LENGTH                    equ 0001h
APMCLK_APMCLK2_MASK                      equ 0004h
APMCLK_APMCLK3_POSN                      equ 0003h
APMCLK_APMCLK3_POSITION                  equ 0003h
APMCLK_APMCLK3_SIZE                      equ 0001h
APMCLK_APMCLK3_LENGTH                    equ 0001h
APMCLK_APMCLK3_MASK                      equ 0008h
APMCLK_APMCLK4_POSN                      equ 0004h
APMCLK_APMCLK4_POSITION                  equ 0004h
APMCLK_APMCLK4_SIZE                      equ 0001h
APMCLK_APMCLK4_LENGTH                    equ 0001h
APMCLK_APMCLK4_MASK                      equ 0010h
APMCLK_APMCLK5_POSN                      equ 0005h
APMCLK_APMCLK5_POSITION                  equ 0005h
APMCLK_APMCLK5_SIZE                      equ 0001h
APMCLK_APMCLK5_LENGTH                    equ 0001h
APMCLK_APMCLK5_MASK                      equ 0020h
APMCLK_APMCLK6_POSN                      equ 0006h
APMCLK_APMCLK6_POSITION                  equ 0006h
APMCLK_APMCLK6_SIZE                      equ 0001h
APMCLK_APMCLK6_LENGTH                    equ 0001h
APMCLK_APMCLK6_MASK                      equ 0040h
APMCLK_APMCLK7_POSN                      equ 0007h
APMCLK_APMCLK7_POSITION                  equ 0007h
APMCLK_APMCLK7_SIZE                      equ 0001h
APMCLK_APMCLK7_LENGTH                    equ 0001h
APMCLK_APMCLK7_MASK                      equ 0080h

// Register: APMSTATUSL
#define APMSTATUSL APMSTATUSL
APMSTATUSL                               equ 01F69h
// bitfield definitions
APMSTATUSL_APMSTATUS_POSN                equ 0000h
APMSTATUSL_APMSTATUS_POSITION            equ 0000h
APMSTATUSL_APMSTATUS_SIZE                equ 0008h
APMSTATUSL_APMSTATUS_LENGTH              equ 0008h
APMSTATUSL_APMSTATUS_MASK                equ 00FFh
APMSTATUSL_SOSC_POSN                     equ 0000h
APMSTATUSL_SOSC_POSITION                 equ 0000h
APMSTATUSL_SOSC_SIZE                     equ 0001h
APMSTATUSL_SOSC_LENGTH                   equ 0001h
APMSTATUSL_SOSC_MASK                     equ 0001h
APMSTATUSL_POSC_POSN                     equ 0001h
APMSTATUSL_POSC_POSITION                 equ 0001h
APMSTATUSL_POSC_SIZE                     equ 0001h
APMSTATUSL_POSC_LENGTH                   equ 0001h
APMSTATUSL_POSC_MASK                     equ 0002h
APMSTATUSL_BG_POSN                       equ 0002h
APMSTATUSL_BG_POSITION                   equ 0002h
APMSTATUSL_BG_SIZE                       equ 0001h
APMSTATUSL_BG_LENGTH                     equ 0001h
APMSTATUSL_BG_MASK                       equ 0004h
APMSTATUSL_FVR1_POSN                     equ 0003h
APMSTATUSL_FVR1_POSITION                 equ 0003h
APMSTATUSL_FVR1_SIZE                     equ 0001h
APMSTATUSL_FVR1_LENGTH                   equ 0001h
APMSTATUSL_FVR1_MASK                     equ 0008h
APMSTATUSL_FVR2_POSN                     equ 0004h
APMSTATUSL_FVR2_POSITION                 equ 0004h
APMSTATUSL_FVR2_SIZE                     equ 0001h
APMSTATUSL_FVR2_LENGTH                   equ 0001h
APMSTATUSL_FVR2_MASK                     equ 0010h
APMSTATUSL_ADCD_POSN                     equ 0005h
APMSTATUSL_ADCD_POSITION                 equ 0005h
APMSTATUSL_ADCD_SIZE                     equ 0001h
APMSTATUSL_ADCD_LENGTH                   equ 0001h
APMSTATUSL_ADCD_MASK                     equ 0020h
APMSTATUSL_ADCA_POSN                     equ 0006h
APMSTATUSL_ADCA_POSITION                 equ 0006h
APMSTATUSL_ADCA_SIZE                     equ 0001h
APMSTATUSL_ADCA_LENGTH                   equ 0001h
APMSTATUSL_ADCA_MASK                     equ 0040h
APMSTATUSL_TEMP_POSN                     equ 0007h
APMSTATUSL_TEMP_POSITION                 equ 0007h
APMSTATUSL_TEMP_SIZE                     equ 0001h
APMSTATUSL_TEMP_LENGTH                   equ 0001h
APMSTATUSL_TEMP_MASK                     equ 0080h
APMSTATUSL_APMSTATUS_2_POSN              equ 0002h
APMSTATUSL_APMSTATUS_2_POSITION          equ 0002h
APMSTATUSL_APMSTATUS_2_SIZE              equ 0001h
APMSTATUSL_APMSTATUS_2_LENGTH            equ 0001h
APMSTATUSL_APMSTATUS_2_MASK              equ 0004h
APMSTATUSL_APMSTATUS_3_POSN              equ 0003h
APMSTATUSL_APMSTATUS_3_POSITION          equ 0003h
APMSTATUSL_APMSTATUS_3_SIZE              equ 0001h
APMSTATUSL_APMSTATUS_3_LENGTH            equ 0001h
APMSTATUSL_APMSTATUS_3_MASK              equ 0008h
APMSTATUSL_APMSTATUS_4_POSN              equ 0004h
APMSTATUSL_APMSTATUS_4_POSITION          equ 0004h
APMSTATUSL_APMSTATUS_4_SIZE              equ 0001h
APMSTATUSL_APMSTATUS_4_LENGTH            equ 0001h
APMSTATUSL_APMSTATUS_4_MASK              equ 0010h
APMSTATUSL_APMSTATUS_5_POSN              equ 0005h
APMSTATUSL_APMSTATUS_5_POSITION          equ 0005h
APMSTATUSL_APMSTATUS_5_SIZE              equ 0001h
APMSTATUSL_APMSTATUS_5_LENGTH            equ 0001h
APMSTATUSL_APMSTATUS_5_MASK              equ 0020h
APMSTATUSL_APMSTATUS_6_POSN              equ 0006h
APMSTATUSL_APMSTATUS_6_POSITION          equ 0006h
APMSTATUSL_APMSTATUS_6_SIZE              equ 0001h
APMSTATUSL_APMSTATUS_6_LENGTH            equ 0001h
APMSTATUSL_APMSTATUS_6_MASK              equ 0040h
APMSTATUSL_APMSTATUS_7_POSN              equ 0007h
APMSTATUSL_APMSTATUS_7_POSITION          equ 0007h
APMSTATUSL_APMSTATUS_7_SIZE              equ 0001h
APMSTATUSL_APMSTATUS_7_LENGTH            equ 0001h
APMSTATUSL_APMSTATUS_7_MASK              equ 0080h

// Register: APMSTATUSH
#define APMSTATUSH APMSTATUSH
APMSTATUSH                               equ 01F6Ah
// bitfield definitions
APMSTATUSH_APMSTATUS_POSN                equ 0000h
APMSTATUSH_APMSTATUS_POSITION            equ 0000h
APMSTATUSH_APMSTATUS_SIZE                equ 0008h
APMSTATUSH_APMSTATUS_LENGTH              equ 0008h
APMSTATUSH_APMSTATUS_MASK                equ 00FFh
APMSTATUSH_OPA1_POSN                     equ 0000h
APMSTATUSH_OPA1_POSITION                 equ 0000h
APMSTATUSH_OPA1_SIZE                     equ 0001h
APMSTATUSH_OPA1_LENGTH                   equ 0001h
APMSTATUSH_OPA1_MASK                     equ 0001h
APMSTATUSH_OPA2_POSN                     equ 0001h
APMSTATUSH_OPA2_POSITION                 equ 0001h
APMSTATUSH_OPA2_SIZE                     equ 0001h
APMSTATUSH_OPA2_LENGTH                   equ 0001h
APMSTATUSH_OPA2_MASK                     equ 0002h
APMSTATUSH_DAC1_POSN                     equ 0002h
APMSTATUSH_DAC1_POSITION                 equ 0002h
APMSTATUSH_DAC1_SIZE                     equ 0001h
APMSTATUSH_DAC1_LENGTH                   equ 0001h
APMSTATUSH_DAC1_MASK                     equ 0004h
APMSTATUSH_DAC2_POSN                     equ 0003h
APMSTATUSH_DAC2_POSITION                 equ 0003h
APMSTATUSH_DAC2_SIZE                     equ 0001h
APMSTATUSH_DAC2_LENGTH                   equ 0001h
APMSTATUSH_DAC2_MASK                     equ 0008h
APMSTATUSH_CMP1_POSN                     equ 0005h
APMSTATUSH_CMP1_POSITION                 equ 0005h
APMSTATUSH_CMP1_SIZE                     equ 0001h
APMSTATUSH_CMP1_LENGTH                   equ 0001h
APMSTATUSH_CMP1_MASK                     equ 0020h
APMSTATUSH_CMPLP1_POSN                   equ 0006h
APMSTATUSH_CMPLP1_POSITION               equ 0006h
APMSTATUSH_CMPLP1_SIZE                   equ 0001h
APMSTATUSH_CMPLP1_LENGTH                 equ 0001h
APMSTATUSH_CMPLP1_MASK                   equ 0040h
APMSTATUSH_ZCD_POSN                      equ 0007h
APMSTATUSH_ZCD_POSITION                  equ 0007h
APMSTATUSH_ZCD_SIZE                      equ 0001h
APMSTATUSH_ZCD_LENGTH                    equ 0001h
APMSTATUSH_ZCD_MASK                      equ 0080h
APMSTATUSH_APMSTATUS_8_POSN              equ 0000h
APMSTATUSH_APMSTATUS_8_POSITION          equ 0000h
APMSTATUSH_APMSTATUS_8_SIZE              equ 0001h
APMSTATUSH_APMSTATUS_8_LENGTH            equ 0001h
APMSTATUSH_APMSTATUS_8_MASK              equ 0001h
APMSTATUSH_APMSTATUS_9_POSN              equ 0001h
APMSTATUSH_APMSTATUS_9_POSITION          equ 0001h
APMSTATUSH_APMSTATUS_9_SIZE              equ 0001h
APMSTATUSH_APMSTATUS_9_LENGTH            equ 0001h
APMSTATUSH_APMSTATUS_9_MASK              equ 0002h
APMSTATUSH_APMSTATUS_10_POSN             equ 0002h
APMSTATUSH_APMSTATUS_10_POSITION         equ 0002h
APMSTATUSH_APMSTATUS_10_SIZE             equ 0001h
APMSTATUSH_APMSTATUS_10_LENGTH           equ 0001h
APMSTATUSH_APMSTATUS_10_MASK             equ 0004h
APMSTATUSH_APMSTATUS_11_POSN             equ 0003h
APMSTATUSH_APMSTATUS_11_POSITION         equ 0003h
APMSTATUSH_APMSTATUS_11_SIZE             equ 0001h
APMSTATUSH_APMSTATUS_11_LENGTH           equ 0001h
APMSTATUSH_APMSTATUS_11_MASK             equ 0008h
APMSTATUSH_APMSTATUS_13_POSN             equ 0005h
APMSTATUSH_APMSTATUS_13_POSITION         equ 0005h
APMSTATUSH_APMSTATUS_13_SIZE             equ 0001h
APMSTATUSH_APMSTATUS_13_LENGTH           equ 0001h
APMSTATUSH_APMSTATUS_13_MASK             equ 0020h
APMSTATUSH_APMSTATUS_14_POSN             equ 0006h
APMSTATUSH_APMSTATUS_14_POSITION         equ 0006h
APMSTATUSH_APMSTATUS_14_SIZE             equ 0001h
APMSTATUSH_APMSTATUS_14_LENGTH           equ 0001h
APMSTATUSH_APMSTATUS_14_MASK             equ 0040h
APMSTATUSH_APMSTATUS_15_POSN             equ 0007h
APMSTATUSH_APMSTATUS_15_POSITION         equ 0007h
APMSTATUSH_APMSTATUS_15_SIZE             equ 0001h
APMSTATUSH_APMSTATUS_15_LENGTH           equ 0001h
APMSTATUSH_APMSTATUS_15_MASK             equ 0080h

